{
    "Criação de Sites de Alta Performance": [
      {"user": "Quanto custa para criar um site com vocês?", "opi": "Vamos precisar de algumas infos pra te dar um valor certinho. Qual o ramo do seu negócio e que tipo de site você quer (institucional, e-commerce, landing page)?"},
      {"user": "Meu site atual é lento. Vocês conseguem melhorar a velocidade?", "opi": "Sim, a gente pode turbinar a performance do seu site! Usamos técnicas como otimização de imagens e caching pra deixá-lo bem rápido. Quer que a gente analise o seu site atual?"},
      {"user": "Vocês criam sites em WordPress ou só em código próprio?", "opi": "Fazemos em WordPress sim, mas também criamos em código próprio, como Next.js, dependendo do que você precisa. Qual plataforma você prefere?"},
      {"user": "Preciso de um e-commerce. Vocês fazem integração com meios de pagamento?", "opi": "Claro! Nossos e-commerces vêm com integração pra meios de pagamento como Mercado Pago, PagSeguro e até carteiras digitais. Qual seria o ramo da sua loja online?"},
      {"user": "Quanto tempo leva para desenvolver um site institucional?", "opi": "Um site institucional geralmente leva de 15 a 30 dias, dependendo da complexidade. Você tem um prazo específico em mente?"},
      {"user": "Vocês oferecem suporte depois que o site fica pronto?", "opi": "Sim, oferecemos suporte contínuo pra ajustes, atualizações e qualquer dúvida. Quer incluir isso no seu plano?"},
      {"user": "Meu site precisa ter um painel para eu editar conteúdos. Isso é possível?", "opi": "Com certeza! Incluímos um painel intuitivo pra você gerenciar tudo sem complicação. Já usa algum sistema assim ou prefere algo novo?"},
      {"user": "Vocês fazem migração de um site antigo para um novo?", "opi": "Fazemos sim! Migramos tudo com segurança, sem perder dados. Quer que a gente dê uma olhada no seu site atual pra planejar isso?"},
      {"user": "Como funciona a parte de segurança do site? Meu site pode ser hackeado?", "opi": "A gente protege seu site com SSL, firewalls e backups automáticos. Hackeado não vai ser, mas se quiser, podemos explicar mais sobre como blindamos tudo!"},
      {"user": "Vocês conseguem criar um site que fique bem posicionado no Google?", "opi": "Sim, otimizamos tudo pra SEO: velocidade, palavras-chave e estrutura. Quer um site que já comece rankeando bem?"},
      {"user": "Quero um site rápido e seguro, quanto custa?", "opi": "Beleza, um site rápido e seguro é nossa especialidade! Qual o ramo do seu negócio pra eu te passar uma estimativa?"},
      {"user": "Vocês fazem landing pages pra campanhas?", "opi": "Fazemos sim, landing pages otimizadas pra conversão! É pra alguma campanha específica? Me conta mais!"},
      {"user": "Meu site precisa de um blog, vocês incluem isso?", "opi": "Claro, podemos adicionar um blog pro seu site! Ele já tem algum foco ou é pra começar do zero?"},
      {"user": "Como vocês criam sites tão rápidos?", "opi": "Usamos tecnologias modernas como Next.js e caching esperto. Quer saber mais ou prefere ver um exemplo?"},
      {"user": "Quero um site e um chatbot, dá pra fazer junto?", "opi": "Dá sim! Podemos criar um site de alta performance e integrar um chatbot esperto. Qual o ramo do seu negócio pra eu te passar um orçamento combinado?"}
    ],
    "Desenvolvimento de Layouts Modernos": [
      {"user": "Vocês criam o design do site ou só fazem a programação?", "opi": "Fazemos os dois! Criamos o design do zero ou programamos um layout que você já tenha. Você já tem algo em mente?"},
      {"user": "Meu site precisa ter um visual mais moderno. Vocês fazem reformulação?", "opi": "Sim, a gente dá uma repaginada no visual pra ficar moderno e funcional. Quer que eu analise seu site atual?"},
      {"user": "O layout que vocês criam é compatível com celulares e tablets?", "opi": "Totalmente! Nossos layouts são responsivos, ficam ótimos em qualquer tela. Quer um exemplo?"},
      {"user": "Como vocês garantem que o site terá uma navegação intuitiva?", "opi": "Planejamos tudo com base em UX, pra o usuário encontrar o que precisa rapidinho. Quer que eu te mostre como fazemos?"},
      {"user": "Posso escolher as cores e fontes do meu site?", "opi": "Claro, você manda nas cores e fontes! Já tem algo em mente ou quer sugestões?"},
      {"user": "Eu já tenho um design pronto. Vocês conseguem programá-lo?", "opi": "Sim, transformamos seu design em um site funcional. Pode mandar o arquivo que a gente começa!"},
      {"user": "Quanto tempo leva para desenvolver um layout exclusivo para minha empresa?", "opi": "Um layout exclusivo leva umas 2 a 3 semanas, dependendo do detalhe. Tem um prazo em vista?"},
      {"user": "O design de vocês é pensado para aumentar as conversões do meu site?", "opi": "Exato, focamos em UX pra converter mais. Quer um layout que traga resultados?"},
      {"user": "Vocês trabalham com tendências de UI/UX?", "opi": "Sim, estamos sempre antenados nas últimas tendências de UI/UX. Quer algo bem atual?"},
      {"user": "Posso solicitar ajustes no layout depois que estiver pronto?", "opi": "Pode sim, ajustamos tudo até ficar perfeito pra você!"},
      {"user": "Quero um layout moderno e um site rápido, quanto custa?", "opi": "Beleza, layout moderno e site rápido é com a gente! Qual o ramo do seu negócio pra eu te dar um valor?"},
      {"user": "Meu layout precisa ser simples, vocês fazem isso?", "opi": "Fazemos sim, simples e elegante! Me conta mais sobre o que você quer."},
      {"user": "Vocês criam layouts pra e-commerce?", "opi": "Sim, layouts otimizados pra e-commerce são nossa especialidade. Quer um pra sua loja?"},
      {"user": "Como funciona o processo de criação do layout?", "opi": "Começamos entendendo seu negócio, depois criamos o design e ajustamos com você. Quer começar?"},
      {"user": "Quero um layout e hospedagem, dá pra juntar?", "opi": "Dá sim! Podemos criar o layout e oferecer hospedagem premium. Qual o foco do seu projeto?"}
    ],
    "Assistente Virtual Para o Seu Negócio": [
      {"user": "Como funciona o assistente virtual de vocês?", "opi": "Nosso assistente virtual automatiza atendimentos, responde perguntas e integra com WhatsApp ou Telegram, funcionando 24h. Quer saber mais ou prefere um orçamento?"},
      {"user": "Ele pode ser integrado ao WhatsApp e Instagram?", "opi": "Pode sim! Integra com WhatsApp, Telegram e até Instagram, se quiser. Qual canal você usa mais?"},
      {"user": "O assistente pode responder perguntas frequentes automaticamente?", "opi": "Sim, ele responde perguntas comuns rapidinho, economizando seu tempo. Quer configurar algumas agora?"},
      {"user": "Ele consegue aprender e melhorar as respostas com o tempo?", "opi": "Exato, ele aprende com as interações e fica mais esperto. Quer um que evolua com seu negócio?"},
      {"user": "Eu posso personalizar o tom de voz e a linguagem do assistente?", "opi": "Claro, dá pra ajustar o tom pra ser formal, descontraído ou como você quiser. Qual estilo você prefere?"},
      {"user": "Ele pode fazer agendamentos e enviar notificações?", "opi": "Sim, agenda compromissos e manda notificações automaticamente. Quer ele pra organizar algo específico?"},
      {"user": "Meu atendimento precisa ser 24h. O assistente pode substituir um humano?", "opi": "Ele funciona 24h e substitui humanos em tarefas repetitivas, mas pode passar pro time em casos complexos. Quer testar?"},
      {"user": "Ele consegue filtrar clientes interessados antes de passar para um atendente?", "opi": "Sim, ele qualifica os clientes e só passa os mais quentes pro seu time. Quer configurar isso?"},
      {"user": "Como funciona a configuração inicial do assistente?", "opi": "A gente configura tudo com base no seu negócio: perguntas, respostas e integrações. Quer começar?"},
      {"user": "Qual o custo para implementar um assistente virtual no meu negócio?", "opi": "Depende do tamanho do seu atendimento. Qual o ramo do seu negócio pra eu te dar um valor?"},
      {"user": "Quero saber como funciona e os valores do assistente virtual", "opi": "Nosso assistente automatiza atendimentos, integra com WhatsApp e funciona 24h. Sobre valores, qual o ramo do seu negócio pra eu te passar uma estimativa?"},
      {"user": "O assistente pode ajudar com vendas?", "opi": "Sim, ele guia clientes no processo de compra e aumenta conversões. Quer um focado em vendas?"},
      {"user": "Vocês integram o assistente com um site?", "opi": "Integramos sim! Ele pode funcionar no seu site e em outros canais. Quer combinar os dois?"},
      {"user": "Ele fala em outros idiomas?", "opi": "Fala sim, podemos configurar pra vários idiomas. Qual você precisa?"},
      {"user": "Quero um assistente e um site, quanto fica?", "opi": "Show! Podemos criar um site e um assistente virtual juntos. Qual o ramo do seu negócio pra eu te passar um orçamento combinado?"}
    ],
    "Hospedagem de Sites Premium": [
      {"user": "O que diferencia a hospedagem de vocês das opções tradicionais?", "opi": "Nossa hospedagem tem servidores otimizados, segurança reforçada e suporte 24h. Quer saber mais sobre o que te oferecemos?"},
      {"user": "Como vocês garantem que meu site ficará seguro contra hackers?", "opi": "Usamos SSL, firewalls e monitoramento constante pra blindar seu site. Quer mais detalhes sobre segurança?"},
      {"user": "Meu site fica fora do ar com frequência. Vocês oferecem estabilidade?", "opi": "Sim, garantimos 99,9% de uptime com nossos servidores premium. Quer migrar pra cá?"},
      {"user": "Qual o limite de tráfego mensal que minha hospedagem pode suportar?", "opi": "Depende do plano, mas temos opções pra alto tráfego. Quantos visitantes você espera?"},
      {"user": "Posso hospedar e-mails profissionais junto com o site?", "opi": "Pode sim, incluímos e-mails com seu domínio. Quantos você precisa?"},
      {"user": "Vocês fazem backup automático dos meus arquivos?", "opi": "Fazemos backups diários automáticos, tudo seguro. Quer incluir isso no seu plano?"},
      {"user": "Meu site está hospedado em outro lugar. Vocês fazem a migração?", "opi": "Sim, migramos tudo pra você sem dor de cabeça. Quer que a gente comece?"},
      {"user": "Caso aconteça algum problema, como é o suporte técnico de vocês?", "opi": "Nosso suporte é 24h, rápido e especializado. Qualquer coisa, é só chamar!"},
      {"user": "O plano de hospedagem de vocês melhora o carregamento do meu site?", "opi": "Sim, usamos CDN e caching pra deixar seu site voando. Quer testar?"},
      {"user": "Vocês oferecem certificado SSL incluso na hospedagem?", "opi": "Oferecemos sim, SSL grátis em todos os planos. Quer ativar no seu site?"},
      {"user": "Quero hospedagem e um site novo, quanto custa?", "opi": "Beleza, podemos criar o site e hospedar tudo aqui. Qual o ramo do seu negócio pra eu te dar um valor?"},
      {"user": "Minha hospedagem atual é lenta, vocês resolvem?", "opi": "Resolvemos sim, com servidores rápidos e otimizados. Quer migrar pra cá?"},
      {"user": "Vocês têm planos pra e-commerce?", "opi": "Temos planos otimizados pra e-commerce, com alta performance. Quer um pra sua loja?"},
      {"user": "Como funciona o suporte técnico?", "opi": "É 24h por chat, e-mail ou telefone, bem rápido. Já teve algum problema que quer resolver?"},
      {"user": "Quero hospedagem segura e um chatbot, dá pra fazer?", "opi": "Dá sim! Hospedagem segura e um chatbot esperto juntos. Qual o foco do seu projeto?"}
    ],
    "Manutenção e Otimização de Sites": [
      {"user": "Meu site está lento e desatualizado. Vocês conseguem otimizar?", "opi": "Sim, a gente otimiza a velocidade e atualiza tudo pra ficar tinindo. Quer que eu dê uma olhada no seu site?"},
      {"user": "Como funciona o serviço de manutenção contínua?", "opi": "Fazemos atualizações, correções e monitoramento pra seu site nunca parar. Quer um plano assim?"},
      {"user": "Vocês corrigem erros e bugs no meu site?", "opi": "Corrigimos sim, rapidinho! Qual problema tá acontecendo no seu site?"},
      {"user": "Meu site foi invadido. Vocês conseguem resolver?", "opi": "Sim, limpamos a invasão e protegemos pra não acontecer de novo. Quer que a gente comece?"},
      {"user": "Eu preciso atualizar conteúdos com frequência. Vocês podem me ajudar?", "opi": "Podemos sim, seja atualizando pra você ou te dando um painel fácil. Como você prefere?"},
      {"user": "Como funciona o monitoramento de segurança do site?", "opi": "Monitoramos 24h pra pegar qualquer ameaça antes que vire problema. Quer esse cuidado pro seu site?"},
      {"user": "Vocês fazem ajustes para melhorar o SEO do site?", "opi": "Fazemos sim, otimizamos pra ele subir no Google. Quer melhorar o ranqueamento?"},
      {"user": "Meu site quebra quando atualizo plugins. Vocês garantem compatibilidade?", "opi": "Sim, testamos tudo pra evitar quebra. Quer que a gente cuide das atualizações?"},
      {"user": "Vocês oferecem suporte técnico para dúvidas e ajustes?", "opi": "Oferecemos sim, suporte rápido pra qualquer coisa. Já tem alguma dúvida agora?"},
      {"user": "Qual a frequência das atualizações no serviço de manutenção?", "opi": "Atualizamos sempre que necessário, geralmente semanalmente. Quer um plano personalizado?"},
      {"user": "Quero manutenção e um layout novo, quanto fica?", "opi": "Show! Podemos reformular o layout e manter tudo otimizado. Qual o ramo do seu negócio?"},
      {"user": "Meu site tá lento, como vocês otimizam?", "opi": "Otimizamos imagens, código e usamos caching. Quer que eu analise o seu?"},
      {"user": "Vocês recuperam sites fora do ar?", "opi": "Sim, colocamos de volta no ar rapidinho. Tá fora agora?"},
      {"user": "Quero manutenção e hospedagem, dá pra juntar?", "opi": "Dá sim! Hospedagem premium com manutenção inclusa. Me conta mais do seu site!"},
      {"user": "Quanto custa pra otimizar meu site?", "opi": "Depende do tamanho do site. Qual o ramo do seu negócio pra eu te passar um valor?"}
    ],
    "Sites Prontos e Funcionais": [
      {"user": "Como funciona a compra de um site pronto?", "opi": "Você escolhe um modelo, personalizamos com sua marca e colocamos no ar rapidinho. Quer ver os modelos?"},
      {"user": "Os sites prontos podem ser personalizados com minha identidade visual?", "opi": "Sim, ajustamos cores, fontes e imagens pra ficar a sua cara. Já tem uma identidade visual pronta?"},
      {"user": "Em quanto tempo meu site estará no ar após a compra?", "opi": "Em até 48 horas, dependendo dos ajustes. Quer começar logo?"},
      {"user": "Quais funcionalidades estão incluídas nos sites prontos?", "opi": "Vem com design responsivo, SEO básico e painel de edição. Quer algo a mais?"},
      {"user": "O site já vem otimizado para SEO e velocidade?", "opi": "Sim, já vem rápido e pronto pro Google. Quer turbinar ainda mais?"},
      {"user": "Posso adicionar novos recursos ao site pronto no futuro?", "opi": "Pode sim, ele é flexível pra crescer com você. Que recursos você pensa em adicionar?"},
      {"user": "Vocês oferecem suporte caso eu tenha dificuldades para gerenciar o site?", "opi": "Oferecemos sim, suporte pra te ajudar em tudo. Já usa algum sistema assim?"},
      {"user": "O site pronto é compatível com celulares e tablets?", "opi": "Totalmente compatível, fica ótimo em qualquer tela. Quer um exemplo?"},
      {"user": "Posso integrar ferramentas externas, como WhatsApp e chatbots?", "opi": "Sim, integramos WhatsApp, chatbots e mais. Qual ferramenta você quer?"},
      {"user": "O que diferencia um site pronto da criação de um site do zero?", "opi": "O site pronto é mais rápido e econômico, enquanto o do zero é 100% personalizado. Qual você prefere?"},
      {"user": "Quero um site pronto e hospedagem, quanto custa?", "opi": "Beleza, podemos te dar um site pronto com hospedagem inclusa. Qual o ramo do seu negócio?"},
      {"user": "O site pronto funciona pra e-commerce?", "opi": "Sim, temos modelos prontos pra e-commerce. Quer um pra sua loja?"},
      {"user": "Quero um site pronto com blog, dá pra fazer?", "opi": "Dá sim, adicionamos um blog ao modelo escolhido. Qual o foco do blog?"},
      {"user": "Como vocês garantem a segurança do site pronto?", "opi": "Vem com SSL, backups e proteção contra ataques. Quer mais detalhes?"},
      {"user": "Quero saber o preço e como funciona um site pronto", "opi": "Nosso site pronto vem com design moderno e é instalado em até 48h. Sobre preço, qual o ramo do seu negócio pra eu te passar um valor?"}
    ]
  }